# Пожелания к Bitrix функциональности REST обертки над инфоблоками

## Пожелания к функциональности:
- Стандартное построение Endpoints должно быть по возможности следовать fullREST, и иметь однотипное формирвоания, используя все HTTP методы (GET/POST/PUT/PATCH/DELETE/OPTIONS).
- Возможность включения какие эндпоинты доступны для конкретного инфоблока
- Возможность в запросе указать какие именно поля нужно выбрать у сущности
- Возможность настраивать прав в рамках системы прав битрикса
- Возможность написать ПОЛИТИКУ (код) для обработки проверки прав если стандартные права не подходят или нужно настроить какие поля можно выбрать.
- Возможность кастомизировать конкретные ендпоинты если есть необходимость их расширить
- Роутер должен давать возможность расширить пространство сущности.
  Пример: 
  Вместо стандартных
  GET `/news/`
  GET `/news/{id}`
  POST `/news/`
  DELETE `/news/{id}`
  ... и т.д
  Добавить ендпоинт
  /news/myCustomBiznesLogic

## Мотивация
- Решения одного из самых частых случаев решения задач бекендерами.
- Стандартизация между студиями
- Возможность работать с битриксом в примитивных случаях по сценариям NoBackend
  Появляется раздел новостей, с подгрузкой еще и фильтрацией по датам.

  Как сейчас: сейчас бекендер делает свое REST на каких то костылях для этого инфоблока. Потом писал компонент.

  Как хочется: фронтендер создал инфоблок и работает через REST не притрагиваясь к PHP коду. Бекендера не привлекаем, он занят более важными вещами)

